run/buoyantHumidPimpleParcelFoam/freeFallCoolingEvaporation/constant/cloudCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cloudCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection false;
    maxCo           1;

    sourceTerms
    {
        schemes
        {
            ".*"        explicit 1;
        }
    }

    interpolationSchemes
    {
        ".*"            cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               Euler;
    }
}

constantProperties
{
    rho0            1000;
    T0              296.15;
    Cp0             4200.0;
    SLH             2.26471e6;
    DiffCo          24.5e-6;
}

subModels
{
    particleForces
    {
        sphereDragST;
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            cellZoneInjection;
            cellZone        c0;
            massTotal       0;
            SOI             0;
            parcelBasisType fixed;
            nParticle       1;
            numberDensity   1.0e6;
            U0              (0 0 0);
            sizeDistribution
            {
                type            fixedValue;
                fixedValueDistribution
                {
                    value           500e-6;
                }
            }
        }
    }

    dispersionModel none;

    heatTransferModel RanzMarshall;

    RanzMarshallCoeffs
    {
        BirdCorrection false;
    }

    patchInteractionModel standardWallInteraction;

    radiation none;

    standardWallInteractionCoeffs
    {
        type rebound;
    }

    stochasticCollisionModel none;

    surfaceFilmModel none;
}


cloudFunctions
{
}


// ************************************************************************* //
